{
  "robot_1": {
    "is_preview": true,
    "description": "Makara Pumpkin is an AUV designed as a better version of Makara X. It has a bigger dimension which allows more space to put the instruments in it. Makara Pumpkin’s side panel is made from aluminium and looks like a jack o’lantern. Therefore, this robot is called Makara Pumpkin. \\nMakara Pumpkin is equipped with high-end devices. We use Razer Kiyo X as a camera that can gives high quality video. We also use 6 thrusters that have good performances. The last but not least, we use the Nvidia Jetson Xavier NX as the computing device. It offers fast processing that is needed to make the work more accurately. ",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2Fsauvc.png?alt=media&token=08fb597f-cbf6-4b8c-8f89-0f7bbf50b231",
    "name": "Makara Pumpkin",
    "source": "U8GOqvt0ufw",
    "source_type": "video",
    "sub_title": "Singapore AUV Challenge 2022",
    "tags": "latest",
    "type": "AUV",
    "year": 2022
  },
  "robot_2": {
    "is_preview": false,
    "description": "Makara Lite is the first remotely controlled boat we made. It is controlled from a smartphone. Its main purpose is to familiarize the Internet of Things (IoT) in daily life. It also has a small dimension and can be powered by only two 9V DC motors. Makara Lite came up as a twin, Makara Lite I and Makara Lite II.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2001.png?alt=media&token=3252ddc1-f9ee-4f4a-afba-86f5f1bcc60b",
    "name": "Makara Lite II",
    "source": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2001.png?alt=media&token=3252ddc1-f9ee-4f4a-afba-86f5f1bcc60b",
    "source_type": "image",
    "sub_title": "Smartphone Controlled Boat Competition UTM 2021",
    "tags": "",
    "type": "ROV",
    "year": 2022
  },
  "robot_3": {
    "is_preview": false,
    "description": "Makara Lite is the first remotely controlled boat we made. It is controlled from a smartphone. Its main purpose is to familiarize the Internet of Things (IoT) in daily life. It also has a small dimension and can be powered by only two 9V DC motors. Makara Lite came up as a twin, Makara Lite I and Makara Lite II.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%20Lite%20II.png?alt=media&token=0752629f-3999-4809-a5ec-3279afe234cf",
    "name": "Makara Lite I",
    "source": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%20Lite%20II.png?alt=media&token=0752629f-3999-4809-a5ec-3279afe234cf",
    "source_type": "image",
    "sub_title": "Smartphone Controlled Boat Competition UTM 2021",
    "tags": "",
    "type": "ROV",
    "year": 2022
  },
  "robot_4": {
    "is_preview": true,
    "description": "Previously named as Makara MH5 XX, the successor of the previous Makara MH4 XX. Although, this boat is really different in type. Makara Phantom is an ASSV (Autonomous Semi Submarine Surface Vehicle) developed to improve Indonesian maritime defense. Makara Phantom uses a Blue Robotic Thruster T200 that has powerful performance. To maximize its function, Makara Phantom is equipped with torpedos with low equivalent series resistance, coreless motor, dupont cable, aluminium rod shaft, and 3 pin reed switch. To beautify this robot, we add an orca-shaped sticker.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%20Phantom.png?alt=media&token=3fb2d76f-d89d-413a-914b-a8420b67be96",
    "name": "Makara Phantom",
    "source": "yDxnvkYtwT8",
    "source_type": "video",
    "sub_title": "Kontes Kapal Cepat Tak Berawak 2021",
    "tags": "",
    "type": "ASSV",
    "year": 2021
  },
  "robot_5": {
    "is_preview": true,
    "description": "Makara MH4 XX is a design concept ASV developed for the 14th AUVSI International Roboboat Competition. Its design is quite narrow and long. MAKARA MH4 XX is equipped with a control system based on Robot Operating System (ROS) and OpenCV. This control system controls the boat’s trajectory to match the referenced trajectory generated by using OpenCV-based image processing. The referenced trajectory is created by utilizing an algorithm that determines the distance midpoint between the buoys that form the surface vehicle path. ",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%20MH4%20XX.png?alt=media&token=ecb84b7d-860a-427b-a475-a91518f3d434",
    "name": "Makara MH4 XX",
    "source": "2e0AjvCD_Jw",
    "source_type": "video",
    "sub_title": "AUVSI International Roboboat Competition",
    "tags": "",
    "type": "ASV",
    "year": 2021
  },
  "robot_6": {
    "is_preview": true,
    "description": "The glory in vain. Makara X is an ROV prepared to participate in Singapore AUV Challenge 2020. Unfortunately, due to Covid-19 pandemic, the event must be canceled. Makara X has an amazing and compact design consisting of 6 thrusters that gives off great maneuverability, killswitch to ensure safety, and is fully autonomous. These features brought Makara X to the final.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%20X.png?alt=media&token=a7ca6c46-799d-4457-ae78-ff7a607f5985",
    "name": "Makara X",
    "source": "jsRMPio2Jv0",
    "source_type": "video",
    "sub_title": "Singapore AUV Challenge 2020",
    "tags": "",
    "type": "AUV",
    "year": 2020
  },
  "robot_7": {
    "is_preview": false,
    "description": "Makara 09 Mark I B for 12th AUVSI International Roboboat Competition 2019",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2009%20Mark%20II.png?alt=media&token=fa76f69b-efb4-49ca-a705-d4b30e0ce3e4",
    "name": "Makara 09 Mark II",
    "source": "92zz24pb-pw",
    "source_type": "video",
    "sub_title": "AUVSI International Roboboat Competition 2019",
    "tags": "",
    "type": "ASV",
    "year": 2019
  },
  "robot_8": {
    "is_preview": false,
    "description": "Being the successor of the Makara 08, Makara 08 Mark II has a bigger dimension and quite different design. With a goal to achieve the same great feet as its predecessor, Makara 08 Mark II is designed to be able to ensuring public safety, maintaining healty waterways, dan preserving history. It can be done by its special features, such as intelligent image detection, smart control using ROS, robust manipulator, micro ROV, and dop drat mechanism. ",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2008%20Mark%20II.png?alt=media&token=4bfcfdd3-a555-4bf2-a064-185c1c5216b8",
    "name": "Makara 08 Mark II",
    "source": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2008%20Mark%20II.png?alt=media&token=4bfcfdd3-a555-4bf2-a064-185c1c5216b8",
    "source_type": "image",
    "sub_title": "ASEAN MATE Underwater Robot Competition",
    "tags": "",
    "type": "AUV",
    "year": 2019
  },
  "robot_9": {
    "is_preview": false,
    "description": "This unmanned ship has a catamaran hull design, namely by using two hulls that will provide buoyancy to this robot. The two hulls are located symmetrically on the left and right sides of the ship. With this catamaran design, the Makara 09 ship has many advantages in terms of stability and maneuverability.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2009.png?alt=media&token=22a8158d-aef4-4551-92d2-83c68f79f6c4",
    "name": "Makara 09",
    "source": "dhLPs2Z663Q",
    "source_type": "video",
    "sub_title": "Kontes Kapal Cepat Tak Berawak 2018",
    "tags": "",
    "type": "ASV",
    "year": 2018
  },
  "robot_10": {
    "is_preview": false,
    "description": "MAKARA 08 is a ROV (Remotely Operated Vehicle) which has been the first winner of the 2nd ASEAN MATE Underwater Robot Competition 2018. In addition, this ROV is made to overcome the problems occured under the sea such as recognizing aircraft wreckage, lifting it up, determining and fixing OBS (Ocean Bottom Seismometer), and finding a new point for implementing wind turbine. \\nMAKARA 08 is divided into two main parts: main tube, which used to be the place for the electrical component, and the frame which is used to hold the main tube properly and stable. Furthermore, Our ROV is facilitated with a sophisticated manipulator for accomplishing underwater tasks, on which it is powered by a waterproof servo motor to support the mission of grabbing the stuff. To support its speed and maneuver, MAKARA 08 uses four Bluerobotics™ Thruster T100 which are mounted on the main hull of the ROV. Image processing technology is implemented to support ROV in sensing colors and shape during accomplishing underwater tasks. With the compactness of the electrical main board and the safety features attached on the ROV we believe that this ROV could solve the underwater problems and could be developed more in the future.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2008%20Mark%20II.png?alt=media&token=4bfcfdd3-a555-4bf2-a064-185c1c5216b8",
    "name": "Makara 08",
    "source": "9ji2W5b0uU4",
    "source_type": "video",
    "sub_title": "ASEAN MATE Underwater Robot Competition",
    "tags": "",
    "type": "AUV",
    "year": 2018
  },
  "robot_11": {
    "is_preview": false,
    "description": "Aero Makara is a Unmanned Aerial Vehicle (UAV) which competed on 10th AUVSI International Roboboat Competition 2017.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FAero%20Makara.png?alt=media&token=9e0cab63-b090-40ea-9fe1-3cb380090e05",
    "name": "Aero Makara",
    "source": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FAero%20Makara.png?alt=media&token=9e0cab63-b090-40ea-9fe1-3cb380090e05",
    "source_type": "image",
    "sub_title": "AUVSI International Roboboat Competition",
    "tags": "",
    "type": "Drone",
    "year": 2017
  },
  "robot_12": {
    "is_preview": false,
    "description": "Its hull design is based on M80 Stiletto with pentamaran multi-hull configuration which consists of five hulls. Furthermore, it is equipped with twin screw propulsion, motored by Leopard Brushless Motor 2200kV. The advantages of using pentamaran configuration are larger displacement and less energy needed to propel the boat compared to mono-hull.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2007.png?alt=media&token=966df16f-7287-4227-b4b1-631ea205cd83",
    "name": "Makara 07",
    "source": "z4wQWsoyoAU",
    "source_type": "video",
    "sub_title": "AUVSI International Roboboat Competition",
    "tags": "",
    "type": "ASV",
    "year": 2017
  },
  "robot_13": {
    "is_preview": false,
    "description": "Makara 06 is an autonomous submarine which won the first place on Tanoto Student Research Award 2016. Besides, with Makara 05, Makara 06 participated on 9th Annual International RoboBoat Competition 2016 in Virginia, USA.  This superb submarine weighs 10 kg and can dive 10 meters underwater. Its maximum speed is 0.5 knot hour vertical and 1 knot hour horizontal. This submarine’s body is made from PVC.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2006-1.png?alt=media&token=2e2fd2a2-340c-462a-8aa5-31afbd1e816d",
    "name": "Makara 06",
    "source": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2006-1.png?alt=media&token=2e2fd2a2-340c-462a-8aa5-31afbd1e816d",
    "source_type": "image",
    "sub_title": "Tanoto Student Research",
    "tags": "",
    "type": "ROV",
    "year": 2016
  },
  "robot_14": {
    "is_preview": false,
    "description": "Makara 04 is a prototype of the 4th generation ship robot which was designed by the AMV UI Team (Autonomous Marine Vehicle, University of Indonesia). This robot ship has a mission to maintain the defense of the Republic of Indonesia with the ability to spy on foreign ships that are not known in Indonesia's maritime border areas. The design of the makara 04 was adapted from the steam-powered warships of the Dreadnought class in the early 20th century, especially in the bow of the ship which was in the form of an x-inverted bow. The bow of this x-inverted bow is an unusual and sensational bow when it was first introduced by ULSTEIN (a ship company in Norway), because its shape is very different from the bow of conventional ships in general, with a high bow dominated, round and expands slightly above, but has great buoyancy due to the addition of volume in the bow of this shape.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2004.png?alt=media&token=d06a8c30-f4e4-4c73-b2be-8e4117e18e94",
    "name": "Makara 04",
    "source": "xBxCwKjzFTY",
    "source_type": "video",
    "sub_title": "Kontes Kapal Cepat Tak Berawak 2014",
    "tags": "",
    "type": "ASV",
    "year": 2014
  },
  "robot_15": {
    "is_preview": false,
    "description": "Makara-05 is the 5th ASV (Autonomous Surface Vehicle) designed by the AMV UI Team to take part in the 9th Annual International RoboBoat Competition 2016 in Virginia, United States. Makara-05 is the result of the development of the previous ASV (Autonomous Surface Vehicle) namely Makara-01, Makara-02, Makara-03, and Makara-04, resulting in Makara-05 with a trimaran multihull design so that it has many advantages in terms of stability and maneuverability. Where this autonomous ship is directed in the future for the development of robotic community service ships for humanitarian missions such as search and rescue in natural disasters in the waters. By prioritizing safety, this robot ship can replace the role of humans by reaching dangerous areas for \"search and rescue\" needs. In addition, this robot ship can be used as a scout guarding the borders of the Republic of Indonesia for the defense and national defense of the Republic of Indonesia.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2005.png?alt=media&token=8a7accb9-4af7-448a-acde-bc83257a530a",
    "name": "Makara 05",
    "source": "SS7kSZ1lnGw",
    "source_type": "video",
    "sub_title": "AUVSI International Roboboat Competition",
    "tags": "",
    "type": "ASV",
    "year": 2014
  },
  "robot_16": {
    "is_preview": false,
    "description": "Makara 03 is an ASV that was developed for civilian purposes. Main objective of this community engagement is to produce a prototype of Unmanned Surface Vehicle (USV) that will be implemented as part of National Search and Rescue Agency (BASARNAS) supporting equipment, which capable to identify and give accurate information of the location and condition of marine accident so that appropriate and effective action could be taken for rescuing the victims. \\nThe process was begun by identifying the problems usually faced by the rescue team upon receiving an accident report on how to decide the proper aids for the accident without knowing the real condition of the accident. Based on the problems identification aligning perception was carried out with BASARNAS to arrange technical specifications and function of the unmanned boat which could give information of the condition and location of an accident or the search function of SAR. The specifications were then used for designing the boat and continued with the building of the prototype included some stages of trials, the results of the boat's performance were evaluated together with BASARNAS",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2003.png?alt=media&token=963d5eb4-7bba-4458-8f1f-9557885cf4ef",
    "name": "Makara 03",
    "source": "RncT_cUdZaY",
    "source_type": "video",
    "sub_title": "Student Creativity Program DRPM UI",
    "tags": "",
    "type": "ASV",
    "year": 2013
  },
  "robot_17": {
    "is_preview": false,
    "description": "Makara 02 is an autonomous boat that had been made in cooperation with the Indonesian Navy in SEA GHOST Project. It is developed with the intention of ensuring Indonesian maritime defense. It is also designed to be able to participate in the National Unmanned Boat Competition and in the 6th annual international competition that will be organized by the Association of Autonomous Unmanned Vehicle Systems International (AUVSI). We still focused on the following engineering concepts of; naval system, mechatronics, and electrical engineering. A SWATH and Wave Piercing Hull Technology provide great stability and best performance in naval technology. For the beginning tasks still focused on image recognition as well as navigation.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2002.png?alt=media&token=2956bd5e-7b4c-455f-9667-11db54667aca",
    "name": "Makara 02",
    "source": "_PT8B1y4Ujg",
    "source_type": "video",
    "sub_title": "Indonesian Navy",
    "tags": "",
    "type": "ASV",
    "year": 2012
  },
  "robot_18": {
    "is_preview": false,
    "description": "It is our very first boat made from scratch. Makara 01 is made with only 7 students who have big dreams. Makara 01 is an ASV prepared to compete in the International Roboboat Competition 2012. With the dimension of 4.94ft x 2.96ft x 0.73ft and made of high-density foam, this design has a major purpose geared to achieve the missions of the competition. A key aspect of MAKARA-01 design is the ease of transportability from Indonesia to the United States and for the ability to assemble as well as disassemble easily.",
    "images": "https://firebasestorage.googleapis.com/v0/b/amv-web-e92ff.appspot.com/o/robot%2FMakara%2001.png?alt=media&token=3252ddc1-f9ee-4f4a-afba-86f5f1bcc60b",
    "name": "Makara 01",
    "source": "RncT_cUdZaY",
    "source_type": "video",
    "sub_title": "International Roboboat Competition 2012",
    "tags": "",
    "type": "ASV",
    "year": 2012
  }
}
